In [3]:
import pandas as pd

In [4]:
population = pd.Series([9904312,3448737,2890451,2466052], index=['서울','부산','인천','대구'])

In [5]:
population

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [7]:
population[population>=2500000]

서울    9904312
부산    3448737
인천    2890451
dtype: int64

In [8]:
population[population<=5000000]

부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [19]:
population[(2500000<= population) & (population <=5000000)]

부산    3448737
인천    2890451
dtype: int64

In [20]:
data={"서울":9631482, "부산":3393191, "인천":2632035,"대전":1490158}

In [21]:
population2=pd.Series(data)

In [22]:
population2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [24]:
#2015년 population
#2010년 population2
ds = population - population2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [29]:
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [26]:
ds.isnull()

대구     True
대전     True
부산    False
서울    False
인천    False
dtype: bool

In [28]:
ds[ds.isnull()]

대구   NaN
대전   NaN
dtype: float64

In [ ]:
#2015년도와 2010년도의 인구 증가율(%) 계산
#(2015-2010)/2010*100

In [31]:
rs=(population-population2)/population2*100
rs

대구         NaN
대전         NaN
부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [33]:
rs[rs.notnull()]

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [34]:
rs["부산"]=1.6

In [35]:
rs

대구         NaN
대전         NaN
부산    1.600000
서울    2.832690
인천    9.818107
dtype: float64

In [37]:
rs["대구"]=1.41

In [38]:
rs

대구    1.410000
대전         NaN
부산    1.600000
서울    2.832690
인천    9.818107
dtype: float64

In [39]:
del rs["서울"]

In [40]:
rs

대구    1.410000
대전         NaN
부산    1.600000
인천    9.818107
dtype: float64

# dataframe

In [44]:
import pandas as pd

In [45]:
data={'2015':[9904312,3448737,2890451,2466052],
      '2010':[9631482,3393191,2632035,2431774]}
df=pd.DataFrame(data)

In [46]:
df

      2015     2010
0  9904312  9631482
1  3448737  3393191
2  2890451  2632035
3  2466052  2431774

In [49]:
#인덱스 수정
df.index=['서울','부산','인천','대구']
df

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [51]:
data=[[9904312,3448737,2890451,2466052],
     [9631482,3393191,2632035,2431774]]

ind = ['2015','2010']
col = ['서울','부산','인천','대구']
df2 = pd.DataFrame(data,index = ind, columns = col)
df2

           서울       부산       인천       대구
2015  9904312  3448737  2890451  2466052
2010  9631482  3393191  2632035  2431774

In [52]:
# T 인덱스와 컬럼을 바꾸는 기능
df2.T

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [55]:
data=[[9904312,9631482],[3448737,3393191],
      [2890451,2632035],[2466052,2431774]]

ind = ['서울','부산','인천','대구']
col = ['2015','2010']
df3 = pd.DataFrame(data,index = ind, columns = col)
df3

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [56]:
#데이터프레임 안에 있는 값 확인
df3.values

array([[9904312, 9631482],
       [3448737, 3393191],
       [2890451, 2632035],
       [2466052, 2431774]], dtype=int64)

In [57]:
#데이터 프레임의 index확인
df3.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [58]:
#데이터 프레임의 column확인
df3.columns

Index(['2015', '2010'], dtype='object')

In [65]:
#Series로 출력
df3['2010']

서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

In [64]:
#DataFrame으로 출력
df3[['2010']]

       2010
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [113]:
data=[[9904312,9631482],[3448737,3393191],
      [2890451,2632035],[2466052,2431774]]

ind = ['서울','부산','인천','대구']
col = ['2015','2010']
df3 = pd.DataFrame(data,index = ind, columns = col)
df3

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [114]:
df3[['2010','2015']]

       2010     2015
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [115]:
df3['2005']=[9462546,3512547,2517680,2456016]
df3

       2015     2010     2005
서울  9904312  9631482  9462546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
대구  2466052  2431774  2456016

In [116]:
df3[['2005','2010','2015']]

       2005     2010     2015
서울  9462546  9631482  9904312
부산  3512547  3393191  3448737
인천  2517680  2632035  2890451
대구  2456016  2431774  2466052

In [117]:
#데이터 프레임 연산
df['2015']-df['2010']

서울    272830
부산     55546
인천    258416
대구     34278
dtype: int64

In [118]:
df['2015']

서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 2015, dtype: int64

In [119]:
#df3에 "2005_2010_증감" column만들고
#그 값에는 2010-2005 인구데이터 대입
df3['2005_2010_증감']=df3['2010']-df3['2005']
df3

       2015     2010     2005  2005_2010_증감
서울  9904312  9631482  9462546        168936
부산  3448737  3393191  3512547       -119356
인천  2890451  2632035  2517680        114355
대구  2466052  2431774  2456016        -24242

In [120]:
df['2010_2015_증감']=df['2015']-df['2010']
df

       2015     2010  2010_2015_증감
서울  9904312  9631482        272830
부산  3448737  3393191         55546
인천  2890451  2632035        258416
대구  2466052  2431774         34278

In [121]:
#데이터프레임 행 인덱싱
#인덱스 번호 입력 [이상:미만]
df3[0:1]

       2015     2010     2005  2005_2010_증감
서울  9904312  9631482  9462546        168936

In [122]:
#인덱스 값으 입력하면 [이상:이하]
df3['서울':'부산']

       2015     2010     2005  2005_2010_증감
서울  9904312  9631482  9462546        168936
부산  3448737  3393191  3512547       -119356

In [123]:
#loc 인덱서 : loc[행 , 열]
#인덱스와 컬럼의 값을 직접 사용
df.loc['서울':'부산','2015':'2010']

       2015     2010
서울  9904312  9631482
부산  3448737  3393191

In [124]:
#iloc 인덱서 : iloc[행 , 열]
#인덱스와 컬럼의 번호를 사용
df3.iloc[0:1,0:2]

       2015     2010
서울  9904312  9631482

In [142]:
#2015년 데이터 중 인구가 2500000 이상인 데이터만 출력
#2015년 데이터를 2500000이상인가 확인
#Boolean데이터를 df3에 입력
df3['2015']
df3['2015_250만이상']=df3[df3.iloc[:,1]>=2500000]
df3

       2015     2010     2005  2005_2010_증감  2015_250만이상
서울  9904312  9631482  9462546        168936  9.90431e+06
부산  3448737  3393191  3512547       -119356  3.44874e+06
인천  2890451  2632035  2517680        114355  2.89045e+06
대구  2466052  2431774  2456016        -24242          NaN

In [111]:
df3['2015_250만이상']=df3.iloc[:,1]>=2500000
df3

서울    False
부산    False
인천    False
대구    False
Name: 2015, dtype: bool

In [144]:
df3[df3['2015']>=2500000]

       2015     2010     2005  2005_2010_증감  2015_250만이상
서울  9904312  9631482  9462546        168936  9.90431e+06
부산  3448737  3393191  3512547       -119356  3.44874e+06
인천  2890451  2632035  2517680        114355  2.89045e+06

In [145]:
df3[df3['2015']>=2500000]['2015']

서울    9904312
부산    3448737
인천    2890451
Name: 2015, dtype: int64

In [146]:
df3[df3['2015']>=2500000][['2015']]

       2015
서울  9904312
부산  3448737
인천  2890451

In [150]:
df3[df3>=2500000]

         2015       2010       2005  2005_2010_증감  2015_250만이상
서울  9904312.0  9631482.0  9462546.0           NaN  9.90431e+06
부산  3448737.0  3393191.0  3512547.0           NaN  3.44874e+06
인천  2890451.0  2632035.0  2517680.0           NaN  2.89045e+06
대구        NaN        NaN        NaN           NaN          NaN

In [152]:
#loc인덱서는 DataFrame형태에서만 가능
df3[df3['2015']>=2500000].loc[:,'2015':'2010']

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035

In [154]:
df3[df3['2015']>=2500000].loc[:,:'2015']

       2015
서울  9904312
부산  3448737
인천  2890451

# Csv파일 불러오기

In [156]:
population_num = pd.read_csv("population_number.csv",encoding="euc-kr")
population_num

   도시   지역     2015       2010       2005     2000
0  서울  수도권  9904312  9631482.0  9762546.0  9853972
1  부산  경상권  3448737        NaN        NaN  3655437
2  인천  수도권  2890451  2632035.0        NaN  2466338
3  대구  경상권  2466052  2431774.0  2456016.0  2473990

In [158]:
#내가 원하는 column을 index로 만들기
population_num = pd.read_csv("population_number.csv",
                             index_col='도시',
                             encoding="euc-kr")
population_num

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

In [159]:
#value_counts()
#값이 나온 횟수를 세주는 함수
population_num["지역"].value_counts()

경상권    2
수도권    2
Name: 지역, dtype: int64

In [ ]:
##셀 합치기
#에디터모드에서 Shift + m

##셀 나누기
#초록창에서 Crtl + Shift + '-'

In [160]:
#인덱스 값을 기준으로 정렬
#sort_index
#한글은 가나다순 / 영어는 ABC순 / 숫자는 오름차순
population_num.sort_index()

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437
서울  수도권  9904312  9631482.0  9762546.0  9853972
인천  수도권  2890451  2632035.0        NaN  2466338

In [161]:
#데이터 값을 기준으로 정렬
#sort_values
population_num['2015'].sort_values()

도시
대구    2466052
인천    2890451
부산    3448737
서울    9904312
Name: 2015, dtype: int64

In [162]:
population_num['2015'].sort_values(ascending=False)

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 2015, dtype: int64

In [164]:
#DataFrame안에서 정렬
population_num.sort_values(by='2010',ascending=False)

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437

In [167]:
#DataFrame 안에서 정렬
#두개를 기준으로
population_num.sort_values(by=['지역','2010'])

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
서울  수도권  9904312  9631482.0  9762546.0  9853972

In [168]:
del population_num['2015']

In [169]:
population_num

     지역       2010       2005     2000
도시
서울  수도권  9631482.0  9762546.0  9853972
부산  경상권        NaN        NaN  3655437
인천  수도권  2632035.0        NaN  2466338
대구  경상권  2431774.0  2456016.0  2473990